### Importing Libraries

In [3]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [5]:
# Defining path

path = r'/Users/tanu/Desktop/Instacart Basket Analysis/02 Data'

In [7]:
# Importing customer data set

df_cstmr = pd.read_csv(os.path.join(path,'Original data','customers.csv'), index_col = False)

### Wrangling Customer Dataframe

In [10]:
df_cstmr.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [12]:
df_cstmr.shape

(206209, 10)

In [14]:
# Dropping unnecessary column: date_joined

df = df_cstmr.drop(['date_joined'], axis = 1)

In [16]:
# Renaming columns
df = df.rename(columns ={
    'Surnam' : 'Last Name',
    'STATE' : 'State',
    'n_dependants' : 'No. of Dependants',
    'fam_status' : 'Marital status'})

In [22]:
df.shape

(206209, 9)

In [24]:
df.head()

,user_id,First Name,Last Name,Gender,State,Age,No. of Dependants,Marital status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1,married,40374

In [26]:
# Checking for duplicates

In [28]:
duplicates = df.duplicated()

In [30]:
num_duplicates = duplicates.sum()

In [32]:
num_duplicates

0

Observation: No duplicates found

In [36]:
# Checking for data types

df.dtypes

user_id               int64
First Name           object
Last Name            object
Gender               object
State                object
Age                   int64
No. of Dependants     int64
Marital status       object
income                int64
dtype: object

In [43]:
# checking for missing values

df.isnull().sum()

user_id                  0
First Name           11259
Last Name                0
Gender                   0
State                    0
Age                      0
No. of Dependants        0
Marital status           0
income                   0
dtype: int64

Observation : First Name has 11259 NaN (missing values)

In [38]:
# Checking for mix type data

for col in df.columns.tolist():
  weird = (df[[col]].map(type) != df[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df[weird]) > 0:
    print (col)

First Name

Observation : first name has mix data type

In [46]:
df['First Name'] = df['First Name'].astype('str')

In [48]:
df.dtypes

user_id               int64
First Name           object
Last Name            object
Gender               object
State                object
Age                   int64
No. of Dependants     int64
Marital status       object
income                int64
dtype: object

In [50]:
df.isnull().sum()

user_id              0
First Name           0
Last Name            0
Gender               0
State                0
Age                  0
No. of Dependants    0
Marital status       0
income               0
dtype: int64

### Merging customer data with Merged data frame

In [60]:
# Importing Merged dataframe 

ords_prods_merge = pd.read_pickle(os.path.join(path,'Prepared data','ords_prods_merged_grouped.pkl'))

In [64]:
ords_prods_merge.shape

(32404859, 24)

In [62]:
ords_prods_merge.head()

,order_id,user_id,order_number,order_day_of_the_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,price_range_loc,busiest_day,Busiest_days,Busiest_period_of_day,max_order,loyalty_flag,average_spending,spending_label,days_btwn_orders,order_frequency
0,2539329,1,1,2,8,7.0,196,1,0,Soda,...,Mid-range product,Regular busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.0,Regular customer
1,2539329,1,1,2,8,7.0,14084,2,0,Organic Unsweetened Vanilla Almond Milk,...,Mid-range product,Regular busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.0,Regular customer
2,2539329,1,1,2,8,7.0,12427,3,0,Original Beef Jerky,...,Low-range product,Regular busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.0,Regular customer
3,2539329,1,1,2,8,7.0,26088,4,0,Aged White Cheddar Popcorn,...,Low-range product,Regular busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.0,Regular customer
4,2539329,1,1,2,8,7.0,26405,5,0,XL Pick-A-Size Paper Towel Rolls,...,Low-range product,Regular busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.0,Regular customer

In [66]:
ords_prods_merge.dtypes

order_id                     int64
user_id                      int64
order_number                 int64
order_day_of_the_week        int64
order_hour_of_day            int64
days_since_prior_order     float64
product_id                   int64
add_to_cart_order            int64
reordered                    int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
Match                     category
price_range_loc             object
busiest_day                 object
Busiest_days                object
Busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
average_spending           float64
spending_label              object
days_btwn_orders           float64
order_frequency             object
dtype: object

In [68]:
# Merging two data sets

df_merge = pd.merge(ords_prods_merge,df, on = 'user_id', how = 'inner')

In [72]:
df_merge.shape

(32404859, 32)

In [74]:
df_merge.head()

,order_id,user_id,order_number,order_day_of_the_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,days_btwn_orders,order_frequency,First Name,Last Name,Gender,State,Age,No. of Dependants,Marital status,income
0,2539329,1,1,2,8,7.0,196,1,0,Soda,...,20.0,Regular customer,Linda,Nguyen,Female,Alabama,31,3,married,40423
1,2539329,1,1,2,8,7.0,14084,2,0,Organic Unsweetened Vanilla Almond Milk,...,20.0,Regular customer,Linda,Nguyen,Female,Alabama,31,3,married,40423
2,2539329,1,1,2,8,7.0,12427,3,0,Original Beef Jerky,...,20.0,Regular customer,Linda,Nguyen,Female,Alabama,31,3,married,40423
3,2539329,1,1,2,8,7.0,26088,4,0,Aged White Cheddar Popcorn,...,20.0,Regular customer,Linda,Nguyen,Female,Alabama,31,3,married,40423
4,2539329,1,1,2,8,7.0,26405,5,0,XL Pick-A-Size Paper Towel Rolls,...,20.0,Regular customer,Linda,Nguyen,Female,Alabama,31,3,married,40423

In [78]:
# Exporting the new merged data frame

df_merge.to_pickle(os.path.join(path,'Prepared data','ords_prods_cstmr_merged.pkl'))